Autodesk.Revit.DB.FilteredWorksetCollector.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.FilteredWorksetCollector.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.FilteredWorksetCollector.GetFilteredWorksetCollectorIterator
Returns a FilteredWorksetIterator to the worksets passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call. Once you've used the collector to get another iterator or set of passing worksets, the original open iterator is defunct and can't be used again, attempts to call moveNext() or to reset it will throw exceptions.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.GetWorksetIdIteratorInternal
Returns a FilteredWorksetIdIterator to the worksets passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call. Once you've used the collector to get another iterator or set of passing worksets, the original open iterator is defunct and can't be used again, attempts to call moveNext() or to reset it will throw exceptions.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.FirstWorkset
Returns the first workset to pass the filter(s).
Remarks:
This will reset the collector to the beginning and find the first workset that passes the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The first workset.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.FirstWorksetId
Returns the id of the first workset to pass the filter(s).
Remarks:
This will reset the collector to the beginning and find the first workset that passes the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The first workset id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.ToWorksets
Returns the complete set of worksets that pass the filter(s).
Remarks:
This will reset the collector to the beginning and extract all worksets that pass the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The complete array of worksets.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.ToWorksetIds
Returns the complete set of workset ids that pass the filter(s).
Remarks:
This will reset the collector to the beginning and extract all worksets that pass the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The complete set of workset ids.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.OfKind(Autodesk.Revit.DB.WorksetKind)
Applies a WorksetKindFilter to the collector.
Remarks:
Only worksets whose WorksetKind is an exact match to the input WorksetKind will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
worksetKind:
The WorksetKind of the workset.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.WherePasses(Autodesk.Revit.DB.WorksetFilter)
Applies a workset filter to the collector.
Remarks:
The filter will be added as an additional condition that all filtered worksets must pass.
If you have an active iterator to this collector it will be stopped by this call.
filter:
The workset filter.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilteredWorksetCollector.GetWorksetIterator
Returns a FilteredWorksetIterator to the worksets passing the current filter.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.GetWorksetIdIterator
Returns a FilteredWorksetIdIterator to the worksets passing the current filter.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.#ctor(Autodesk.Revit.DB.Document)
Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.
document:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector
This class is used to search, filter and iterate through a set of worksets.
Remarks:
Developers can assign a condition to filter the worksets that are returned.
If no condition is applied, it attempts to access all the worksets in the document.
The collector will reset if you call another method to
extract worksets.  Thus, if you have previously obtained an iterator, it will be stopped and traverse no more
worksets if you call another method to extract worksets.
Since:
2012